<?php 

/* 性别统计维度设定 */
$config['gender_map'] = array (
	0 => '未知',
	1 => '女',
	2 => '男'
);

/* 地区统计维度设定 */
$config['region_map'] = array (
		11 => '北京',
		12 => '天津',
		13 => '河北',
		14 => '山西',
		15 => '内蒙古',
		21 => '辽宁',
		22 => '吉林',
		23 => '黑龙江',
		31 => '上海',
		32 => '江苏',
		33 => '浙江',
		34 => '安徽',
		35 => '福建',
		36 => '江西',
		37 => '山东',
		41 => '河南',
		42 => '湖北',
		43 => '湖南',
		44 => '广东',
		45 => '广西',
		46 => '海南',
		50 => '重庆',
		51 => '四川',
		52 => '贵州',
		53 => '云南',
		54 => '西藏',
		61 => '陕西',
		62 => '甘肃',
		63 => '青海',
		64 => '宁夏',
		65 => '新疆',
		71 => '台湾',
		81 => '香港',
		82 => '澳门',
		100 => '其他',
		400 => '海外'
);

/* 身份统计维度设定 */
$config['vt_map'] = array (
	'-1'	=> '普通',
	'999'	=> '普通',

	'-2'	=> '认证用户', 	// 腾讯认证用户

	'0'		=> '个人认证',

	'1'		=> '企业认证',
	'2'		=> '企业认证',
	'3'		=> '企业认证',
	'4'		=> '企业认证',
	'5'		=> '企业认证',
	'6'		=> '企业认证',
	'7'		=> '企业认证',
	'8'		=> '企业认证',

	'10'	=> '达人',
	'200'	=> '达人',
	'220'	=> '达人',
	'400'	=> '达人'
);

/* 粉丝量统计维度设定 */
$config['sf_map'] = array (
	0 => '< 99', 
	1 => '100 ~ 499', 
	2 => '500 ~ 999', 
	3 => '1000 ~ 4999', 
	4 => '5000 ~ 9999', 
	5 => '10000 ~ 99999', 
	6 => '> 100000'
);