<?php 

/* 筛选用户的过滤参数 */
$config['filter_params'] = array (

	'verify_type_sina' => array ( 			# [新浪微博用户身份]
		'-1' => '普通', 
		'220' => '达人', 
		'0' => '个人认证', 
		'2' => '企业认证'
	),

	'verify_type_tx' => array ( 			# [腾讯微博用户身份]
		'999' => '普通', 
		'-2' => '认证'
	),

	'followers_count' => array ( 			# [粉丝量区间]
		'0-99' 			=> '0 - 99', 
		'100-499' 		=> '100 - 499', 
		'500-999' 		=> '500 - 999', 
		'1000-4999' 	=> '1000 - 4999', 
		'5000-9999' 	=> '5000 - 9999', 
		'10000-49999' 	=> '10000 - 49999', 
		'50000-99999' 	=> '50000 - 49999', 
		'100000-' 		=> '100000 +'
	),

	'statuses_count' => array ( 			# [微博量区间]
		'0-99' 			=> '0 - 99', 
		'100-499' 		=> '100 - 499', 
		'500-999' 		=> '500 - 999', 
		'1000-4999' 	=> '1000 - 4999', 
		'5000-9999' 	=> '5000 - 9999', 
		'10000-' 		=> '10000 +'
	),

	'gender' => array ( 					# [性别]
		1 => '男', 
		2 => '女', 
		0 => '未知'
	),

	'relation' => array (					# [用户关系]
		0 => '无关系', 
		1 => '关注我的', 
		2 => '我关注的', 
		3 => '双向关注'
	), 

	'doublev' => array ( 					# [关联双微]
		0 => '未关联', 
		1 => '已关联'
	),

	'subscribe' => array ( 					# [是否订阅]
		0 => '未订阅',
		1 => '已订阅'
	),

	'province' => array ( 					# [所在地区 TODO: 待补全]
		11 => '北京', 
		12 => '天津', 
		31 => '上海'
	)

);

/* 筛选过滤参数名 */
$config['param_labels'] = array (

	'basic' 			=> '基本条件', 
	'cim' 				=> 'CIM', 
	'keyword' 			=> '关键字', 
	'tag' 				=> '用户标签', 
	'event' 			=> '活动历史', 
	'communication' 	=> '微博交流', 
	'history' 			=> '沟通记录', 

	'gender' 			=> '性别', 
	'doublev' 			=> '双微关联', 
	'account' 			=> '微博账号', 
	'province' 			=> '所在地区', 
	'relation' 			=> '品牌关系', 
	'subscribe' 		=> '是否订阅', 
	'statuses_count' 	=> '微博数', 
	'verify_type_tx' 	=> '微博身份', 
	'followers_count' 	=> '粉丝数', 
	'verify_type_sina' 	=> '微博身份'

);